module.exports = {
    code() {
        let codes = {
            200: {
                "code": 200,
                "msg": "操作成功"
            },
            201: {
                "code": 201,
                "msg": "对象创建成功"
            },
            202: {
                "code": 202,
                "msg": "请求已经被接受"
            },
            204: {
                "code": 204,
                "msg": "操作已经执行成功，但是没有返回数据"
            },
            301: {
                "code": 301,
                "msg": "资源已被移除"
            },
            303: {
                "code": 303,
                "msg": "重定向"
            },
            304: {
                "code": 304,
                "msg": "资源没有被修改"
            },
            400: {
                "code": 400,
                "msg": "参数列表错误（缺少，格式不匹配）"
            },
            403: {
                "code": 403,
                "msg": "访问受限，授权过期"
            },
            404: {
                "code": 404,
                "msg": "资源，服务未找！"
            },
            405: {
                "code": 405,
                "msg": "不允许的http方法"
            },
            409: {
                "code": 409,
                "msg": "资源冲突，或者资源被锁"
            },
            415: {
                "code": 415,
                "msg": "不支持的数据，媒体类型"
            },
            500: {
                "code": 500,
                "msg": "系统内部错误"
            },
            501: {
                "code": 501,
                "msg": "接口未实现"
            },
        }
        // return 
    }
}